app/controllers/projetos_controller.rb

  def show
    @projeto = Projeto.find(params[:id])
---
SELECT * FROM `projetos` WHERE (`projetos`.`id` = 1)

  def edit
    @projeto = Projeto.find(params[:id])
---
SELECT * FROM `projetos` WHERE (`projetos`.`id` = 1)

  def create
    @projeto = Projeto.new(params[:projeto])

    respond_to do |format|
      if @projeto.save
---
INSERT INTO `projetos` (`updated_at`, `Nome`, `DtTermino`, `Orcamento`, `DtInicio`, `created_at`) VALUES('2009-02-17 15:51:18', 'Mix', '2009-02-17', 100.0, '2009-02-17', '2009-02-17 15:51:18')

  def update
    @projeto = Projeto.find(params[:id])
---
SELECT * FROM `projetos` WHERE (`projetos`.`id` = 2)

  def destroy
    @projeto = Projeto.find(params[:id])
    @projeto.destroy
---
SELECT * FROM `projetos` WHERE (`projetos`.`id` = 1)
DELETE FROM `projetos` WHERE `id` = 1